<a href="https://colab.research.google.com/github/HwangHanJae/datascience-basic-tect/blob/main/pandas_10minutes_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
- 10 minutes to pandas

# 라이브러리 로드

In [1]:
import numpy as np
import pandas as pd

# 객체 생성

value의 리스트를 전달하여 Series 타입을 생성하고 pandas의 기본 인덱스를 적용합니다.

In [2]:
#Input
s = pd.Series([1,3,5, np.nan, 6,8])
#Output
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

datatime 타입과 레이블이있는 column과 Numpy array를 전달하여 Dataframe을 생성합니다.

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.031585 -0.150353  0.973961  1.500201
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932
2013-01-03  0.336118 -0.781013  0.511561  0.703153
2013-01-04  3.157792 -0.085794  0.281620 -0.894749
2013-01-05 -1.184798 -0.253423 -0.360976  0.855927
2013-01-06 -0.189598 -2.109085 -0.015296 -0.611409

Series 타입처럼 변환할수 있는 객체의 dict 타입을 전달하여 DataFrame을 생성합니다.

In [5]:
df2 = pd.DataFrame(
    {"A" : 1.0,
    "B" : pd.Timestamp("20130102"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.array([3] *4, dtype="int32"),
    "E" : pd.Categorical(["test","train","test","train"]),
    "F" : 'foo',}
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Dataframe의 columns 들은 다른 dtypes를 가지고 있습니다.

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 데이터 관찰

데이터 프레임의 상단, 하단을 보는 방법입니다.

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -0.031585 -0.150353  0.973961  1.500201
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932
2013-01-03  0.336118 -0.781013  0.511561  0.703153
2013-01-04  3.157792 -0.085794  0.281620 -0.894749
2013-01-05 -1.184798 -0.253423 -0.360976  0.855927

In [8]:
df.tail()

                   A         B         C         D
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932
2013-01-03  0.336118 -0.781013  0.511561  0.703153
2013-01-04  3.157792 -0.085794  0.281620 -0.894749
2013-01-05 -1.184798 -0.253423 -0.360976  0.855927
2013-01-06 -0.189598 -2.109085 -0.015296 -0.611409

index, columns를 표현합니다.

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy()는 NumPy 표현을 제공합니다.

In [11]:
df

                   A         B         C         D
2013-01-01 -0.031585 -0.150353  0.973961  1.500201
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932
2013-01-03  0.336118 -0.781013  0.511561  0.703153
2013-01-04  3.157792 -0.085794  0.281620 -0.894749
2013-01-05 -1.184798 -0.253423 -0.360976  0.855927
2013-01-06 -0.189598 -2.109085 -0.015296 -0.611409

In [12]:
df.to_numpy()

array([[-0.03158524, -0.1503533 ,  0.97396125,  1.50020069],
       [-0.57393754, -0.64311016,  2.36233329, -0.87093151],
       [ 0.33611758, -0.7810134 ,  0.51156054,  0.70315253],
       [ 3.15779225, -0.08579436,  0.28162027, -0.89474922],
       [-1.18479832, -0.2534233 , -0.36097573,  0.85592742],
       [-0.18959819, -2.10908467, -0.01529598, -0.61140933]])

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

DataFrame.to_numpy()는 index와 columns를 포함하지 않습니다.

Data를 T(transpose)합니다.

In [15]:
df

                   A         B         C         D
2013-01-01 -0.031585 -0.150353  0.973961  1.500201
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932
2013-01-03  0.336118 -0.781013  0.511561  0.703153
2013-01-04  3.157792 -0.085794  0.281620 -0.894749
2013-01-05 -1.184798 -0.253423 -0.360976  0.855927
2013-01-06 -0.189598 -2.109085 -0.015296 -0.611409

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.031585   -0.573938    0.336118    3.157792   -1.184798   -0.189598
B   -0.150353   -0.643110   -0.781013   -0.085794   -0.253423   -2.109085
C    0.973961    2.362333    0.511561    0.281620   -0.360976   -0.015296
D    1.500201   -0.870932    0.703153   -0.894749    0.855927   -0.611409

axis=1(열)을 기준으로 정렬합니다.

In [17]:
df

                   A         B         C         D
2013-01-01 -0.031585 -0.150353  0.973961  1.500201
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932
2013-01-03  0.336118 -0.781013  0.511561  0.703153
2013-01-04  3.157792 -0.085794  0.281620 -0.894749
2013-01-05 -1.184798 -0.253423 -0.360976  0.855927
2013-01-06 -0.189598 -2.109085 -0.015296 -0.611409

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.500201  0.973961 -0.150353 -0.031585
2013-01-02 -0.870932  2.362333 -0.643110 -0.573938
2013-01-03  0.703153  0.511561 -0.781013  0.336118
2013-01-04 -0.894749  0.281620 -0.085794  3.157792
2013-01-05  0.855927 -0.360976 -0.253423 -1.184798
2013-01-06 -0.611409 -0.015296 -2.109085 -0.189598

values를 기준으로 정렬합니다.

기본적으로 오름차순이 적용됩니다. ascending = True

In [19]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06 -0.189598 -2.109085 -0.015296 -0.611409
2013-01-03  0.336118 -0.781013  0.511561  0.703153
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932
2013-01-05 -1.184798 -0.253423 -0.360976  0.855927
2013-01-01 -0.031585 -0.150353  0.973961  1.500201
2013-01-04  3.157792 -0.085794  0.281620 -0.894749

# 가져오기

single column을 선택하면 Series 가 생성이 됩니다.

df.A와 기능이 동등합니다.

In [20]:
df["A"]

2013-01-01   -0.031585
2013-01-02   -0.573938
2013-01-03    0.336118
2013-01-04    3.157792
2013-01-05   -1.184798
2013-01-06   -0.189598
Freq: D, Name: A, dtype: float64

[]을 사용하면 행을 분할(슬라이싱) 합니다.

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.031585 -0.150353  0.973961  1.500201
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932
2013-01-03  0.336118 -0.781013  0.511561  0.703153

In [22]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932
2013-01-03  0.336118 -0.781013  0.511561  0.703153
2013-01-04  3.157792 -0.085794  0.281620 -0.894749

# 레이블별 선택

레이블을 사용하여 가져오기

In [23]:
df.loc[dates[0]]

A   -0.031585
B   -0.150353
C    0.973961
D    1.500201
Name: 2013-01-01 00:00:00, dtype: float64

컬럼을 다중으로 선택하여 가져오기

In [24]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -0.031585 -0.150353
2013-01-02 -0.573938 -0.643110
2013-01-03  0.336118 -0.781013
2013-01-04  3.157792 -0.085794
2013-01-05 -1.184798 -0.253423
2013-01-06 -0.189598 -2.109085

종료지점을 포함한 슬라이싱

In [25]:
df.loc["20130102" : "20130104", ["A","B"]]

                   A         B
2013-01-02 -0.573938 -0.643110
2013-01-03  0.336118 -0.781013
2013-01-04  3.157792 -0.085794

객체가 반환하는 차원이 감소합니다.

In [26]:
df.loc["20130102", ["A","B"]]

A   -0.573938
B   -0.643110
Name: 2013-01-02 00:00:00, dtype: float64

scalar 값을 가져옵니다

In [27]:
df.loc[dates[0], "A"]

-0.03158524366606699

scalar에 빠르게 엑세스하여 가져오는 방법입니다.

In [28]:
# df.at["20130101","A"]
df.at[dates[0],"A"]

-0.03158524366606699

# 위치(position)별로 선택

전달된 정수(integers)의 위치를 통해 다음을 선택

In [29]:
df.iloc[3]

A    3.157792
B   -0.085794
C    0.281620
D   -0.894749
Name: 2013-01-04 00:00:00, dtype: float64

슬라이싱을 통해 Numpy/Python과 유사하게 작동합니다.

In [30]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  3.157792 -0.085794
2013-01-05 -1.184798 -0.253423

정수 리스트를 통해 표현

In [31]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.573938  2.362333
2013-01-03  0.336118  0.511561
2013-01-05 -1.184798 -0.360976

row(행)만 슬라이싱을 합니다.

In [32]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932
2013-01-03  0.336118 -0.781013  0.511561  0.703153

columns(열)만 슬라이싱 합니다.

In [33]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.150353  0.973961
2013-01-02 -0.643110  2.362333
2013-01-03 -0.781013  0.511561
2013-01-04 -0.085794  0.281620
2013-01-05 -0.253423 -0.360976
2013-01-06 -2.109085 -0.015296

value(값)로 가져옵니다.

In [34]:
df.iloc[1,1]

-0.6431101557595033

scalar를 빠르게 엑세스하여 가져옵니다.

In [35]:
df.iat[1,1]

-0.6431101557595033

#Boolean indexing

single column의 value를 통해 선택합니다.

In [36]:
df[df["A"]>0]

                   A         B         C         D
2013-01-03  0.336118 -0.781013  0.511561  0.703153
2013-01-04  3.157792 -0.085794  0.281620 -0.894749

In [37]:
df

                   A         B         C         D
2013-01-01 -0.031585 -0.150353  0.973961  1.500201
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932
2013-01-03  0.336118 -0.781013  0.511561  0.703153
2013-01-04  3.157792 -0.085794  0.281620 -0.894749
2013-01-05 -1.184798 -0.253423 -0.360976  0.855927
2013-01-06 -0.189598 -2.109085 -0.015296 -0.611409

In [38]:
df[df>0]

                   A   B         C         D
2013-01-01       NaN NaN  0.973961  1.500201
2013-01-02       NaN NaN  2.362333       NaN
2013-01-03  0.336118 NaN  0.511561  0.703153
2013-01-04  3.157792 NaN  0.281620       NaN
2013-01-05       NaN NaN       NaN  0.855927
2013-01-06       NaN NaN       NaN       NaN

isin() method를 통해 필터링

In [39]:
df2 = df.copy()
df2['E'] = ["one","one","two","three","four","three"]
df2

                   A         B         C         D      E
2013-01-01 -0.031585 -0.150353  0.973961  1.500201    one
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932    one
2013-01-03  0.336118 -0.781013  0.511561  0.703153    two
2013-01-04  3.157792 -0.085794  0.281620 -0.894749  three
2013-01-05 -1.184798 -0.253423 -0.360976  0.855927   four
2013-01-06 -0.189598 -2.109085 -0.015296 -0.611409  three

In [40]:
df2[df2['E'].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03  0.336118 -0.781013  0.511561  0.703153   two
2013-01-05 -1.184798 -0.253423 -0.360976  0.855927  four

# Setting

새로운 column을 설정하면 index별로 데이터가 자동으로 정렬됩니다.

In [41]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df['F'] = s1

In [43]:
df

                   A         B         C         D    F
2013-01-01 -0.031585 -0.150353  0.973961  1.500201  NaN
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932  1.0
2013-01-03  0.336118 -0.781013  0.511561  0.703153  2.0
2013-01-04  3.157792 -0.085794  0.281620 -0.894749  3.0
2013-01-05 -1.184798 -0.253423 -0.360976  0.855927  4.0
2013-01-06 -0.189598 -2.109085 -0.015296 -0.611409  5.0

label 별로 value를 설정합니다.

In [44]:
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.150353  0.973961  1.500201  NaN
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932  1.0
2013-01-03  0.336118 -0.781013  0.511561  0.703153  2.0
2013-01-04  3.157792 -0.085794  0.281620 -0.894749  3.0
2013-01-05 -1.184798 -0.253423 -0.360976  0.855927  4.0
2013-01-06 -0.189598 -2.109085 -0.015296 -0.611409  5.0

position 별로 value를 설정합니다.

In [45]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.973961  1.500201  NaN
2013-01-02 -0.573938 -0.643110  2.362333 -0.870932  1.0
2013-01-03  0.336118 -0.781013  0.511561  0.703153  2.0
2013-01-04  3.157792 -0.085794  0.281620 -0.894749  3.0
2013-01-05 -1.184798 -0.253423 -0.360976  0.855927  4.0
2013-01-06 -0.189598 -2.109085 -0.015296 -0.611409  5.0

NumPy array를 할당하여 설정합니다.

In [46]:
df.loc[:,"D"] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.973961  5  NaN
2013-01-02 -0.573938 -0.643110  2.362333  5  1.0
2013-01-03  0.336118 -0.781013  0.511561  5  2.0
2013-01-04  3.157792 -0.085794  0.281620  5  3.0
2013-01-05 -1.184798 -0.253423 -0.360976  5  4.0
2013-01-06 -0.189598 -2.109085 -0.015296  5  5.0

In [47]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.973961 -5  NaN
2013-01-02 -0.573938 -0.643110 -2.362333 -5 -1.0
2013-01-03 -0.336118 -0.781013 -0.511561 -5 -2.0
2013-01-04 -3.157792 -0.085794 -0.281620 -5 -3.0
2013-01-05 -1.184798 -0.253423 -0.360976 -5 -4.0
2013-01-06 -0.189598 -2.109085 -0.015296 -5 -5.0

# 결측치

pandas는 주로  np.nan값을 누락 데이터를 나타내기 위하여 사용합니다.

In [53]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.973961  5  NaN  1.0
2013-01-02 -0.573938 -0.643110  2.362333  5  1.0  1.0
2013-01-03  0.336118 -0.781013  0.511561  5  2.0  NaN
2013-01-04  3.157792 -0.085794  0.281620  5  3.0  NaN

how = 'any' 옵션을 사용하여 결측치를 가지고 있지 않는 데이터를 보여줍니다.

In [54]:
df1.dropna(how='any')

                   A        B         C  D    F    E
2013-01-02 -0.573938 -0.64311  2.362333  5  1.0  1.0

결측치를 채우기

In [55]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.973961  5  5.0  1.0
2013-01-02 -0.573938 -0.643110  2.362333  5  1.0  1.0
2013-01-03  0.336118 -0.781013  0.511561  5  2.0  5.0
2013-01-04  3.157792 -0.085794  0.281620  5  3.0  5.0

nan값을 가진 value를 boolean mask로 가져옵니다.

In [58]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.973961  5  NaN  1.0
2013-01-02 -0.573938 -0.643110  2.362333  5  1.0  1.0
2013-01-03  0.336118 -0.781013  0.511561  5  2.0  NaN
2013-01-04  3.157792 -0.085794  0.281620  5  3.0  NaN

In [56]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True